#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/initialised-si/JoWe-API-Dev/runs/run-uL1hqZXp2zwGTXqY

Waiting for the plan to start...

Terraform v1.5.3
on linux_amd64
Initializing plugins and modules...
module.lambda.data.archive_file.weight_measurements_edit_zip: Refreshing...
module.lambda.data.archive_file.weight_shared_layer_zip: Refreshing...
module.lambda.data.archive_file.weight_measurements_retrieve_zip: Refreshing...
module.lambda.data.archive_file.weight_measurements_edit_zip: Refresh complete after 0s [id=f6cb4fcb6c2e19ab0d941c877ae8888704c16b09]
module.lambda.data.archive_file.weight_measurements_delete_zip: Refreshing...
module.lambda.data.archive_file.weight_targets_delete_zip: Refreshing...
module.lambda.data.archive_file.weight_measurements_delete_user_data_zip: Refreshing...
module.lambda.data.archive_file.common_layer_zip: Refreshing...
module.lambda.data.archive_file.weight_measurements_delete_zip: Refresh complete after 0s [id=a499c2464121a247693d1896477f48d313b34ed6]
module.lambda.data.archive_file.weight_measurements_insert_zip: Refreshing...
module.lambda.data.archive_file.weight_measurements_retrieve_zip: Refresh complete after 0s [id=3362bcc29ed7cdb8f99044734d23bf8df3868e8e]
module.lambda.data.archive_file.weight_shared_layer_zip: Refresh complete after 0s [id=d28866c888c687bf38ab6ffeba5e69a9fde36ec7]
module.lambda.data.archive_file.weight_targets_insert_zip: Refreshing...
module.lambda.data.archive_file.weight_measurements_delete_user_data_zip: Refresh complete after 0s [id=602d09bcde1a05f71af89e3c5ea7dca693d6220e]
module.lambda.data.archive_file.weight_measurements_insert_zip: Refresh complete after 0s [id=6dc2139f20880a1e484c02f24836ef08d80be713]
module.lambda.data.archive_file.weight_targets_delete_zip: Refresh complete after 0s [id=9d4473f521220ead636da903d0068b57bcfd418c]
module.lambda.data.archive_file.common_layer_zip: Refresh complete after 0s [id=46487c34424e06da33e76dcfe08a16dbfe6d3541]
module.lambda.data.archive_file.weight_targets_insert_zip: Refresh complete after 0s [id=3d2fdf3f770c1d41232916db708a5b304ea7e586]
module.lambda.data.archive_file.weight_targets_delete_user_data_zip: Refreshing...
module.lambda.data.archive_file.weight_targets_retrieve_zip: Refreshing...
module.lambda.data.archive_file.weight_targets_delete_user_data_zip: Refresh complete after 0s [id=a0e33578aff78626460e92f29c787af28bc550a3]
module.lambda.data.archive_file.weight_targets_retrieve_zip: Refresh complete after 0s [id=f298a281d43b744419ba3a4751bc4ee1543dc030]
module.lambda.aws_cloudwatch_log_group.weight_measurements_delete_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-measurements-delete-dev]
module.lambda.aws_cloudwatch_log_group.weight_measurements_insert_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-measurements-insert-dev]
module.lambda.aws_cloudwatch_log_group.weight_targets_retrieve_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-targets-retrieve-dev]
module.lambda.data.aws_iam_policy_document.assume_role: Refreshing...
module.api.data.aws_iam_policy_document.assume_role: Refreshing...
module.sns_and_sqs.aws_sns_topic.delete_user_data: Refreshing state... [id=arn:aws:sns:eu-south-1:834514932971:JoWe-delete-user-data-topic-dev]
module.lambda.aws_lambda_layer_version.common_layer: Refreshing state... [id=arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:27]
module.sns_and_sqs.aws_sqs_queue.weight_targets_delete_user_data_dead_letter_queue: Refreshing state... [id=https://sqs.eu-south-1.amazonaws.com/834514932971/JoWe-weight-targets-delete-user-data-dead-letter-dev]
module.db.aws_dynamodb_table.jowe_measurements: Refreshing state... [id=JoWe-weight-measurements-dev]
module.lambda.data.aws_iam_policy_document.assume_role: Refresh complete after 0s [id=2690255455]
module.auth.aws_cognito_user_pool.user_pool: Refreshing state... [id=eu-south-1_lu9o6yXs7]
module.api.data.aws_iam_policy_document.assume_role: Refresh complete after 0s [id=2699642182]
module.lambda.aws_cloudwatch_log_group.weight_measurements_delete_user_data_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-measurements-delete-user-data-dev]
module.api.aws_api_gateway_domain_name.custom_domain_name: Refreshing state... [id=jowe-api-dev.initialised.si]
module.sns_and_sqs.aws_sqs_queue.weight_measurements_delete_user_data_dead_letter_queue: Refreshing state... [id=https://sqs.eu-south-1.amazonaws.com/834514932971/JoWe-weight-measurements-delete-user-data-dead-letter-dev]
module.lambda.aws_cloudwatch_log_group.weight_targets_insert_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-targets-insert-dev]
module.lambda.aws_cloudwatch_event_rule.user_data_deletion_schedule: Refreshing state... [id=JoWe-cloudwatch-user-data-deletion-schedule-dev]
module.lambda.data.aws_iam_policy.AWSLambdaBasicExecutionRole: Refreshing...
module.lambda.aws_lambda_layer_version.weight_shared_layer: Refreshing state... [id=arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:17]
module.lambda.aws_cloudwatch_log_group.weight_targets_delete_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-targets-delete-dev]
module.api.aws_api_gateway_rest_api.jowe_api: Refreshing state... [id=gaj1kflz21]
module.lambda.data.aws_iam_policy.AWSLambdaBasicExecutionRole: Refresh complete after 0s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
module.lambda.aws_cloudwatch_log_group.weight_measurements_retrieve_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-measurements-retrieve-dev]
module.lambda.aws_cloudwatch_log_group.weight_measurements_edit_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-measurements-edit-dev]
module.db.aws_dynamodb_table.jowe_weight_targets: Refreshing state... [id=JoWe-weight-targets-dev]
module.lambda.aws_cloudwatch_log_group.weight_targets_delete_user_data_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-targets-delete-user-data-dev]
module.lambda.aws_iam_role.jowe_api_lambda_crud: Refreshing state... [id=JoWe-api-lambda-crud-dev]
module.lambda.aws_iam_role.jowe_api_lambda_read_only: Refreshing state... [id=JoWe-api-lambda-read-only-dev]
module.api.aws_iam_role.jowe_api_gateway_role: Refreshing state... [id=JoWe-api-gateway-role-dev]
module.sns_and_sqs.data.aws_iam_policy_document.sns_delete_user_data_topic_publish_policy: Refreshing...
module.sns_and_sqs.data.aws_iam_policy_document.sns_delete_user_data_topic_publish_policy: Refresh complete after 0s [id=274515956]
module.sns_and_sqs.aws_sqs_queue.weight_targets_delete_user_data_queue: Refreshing state... [id=https://sqs.eu-south-1.amazonaws.com/834514932971/JoWe-weight-targets-delete-user-data-dev]
module.sns_and_sqs.aws_sqs_queue.weight_measurements_delete_user_data_queue: Refreshing state... [id=https://sqs.eu-south-1.amazonaws.com/834514932971/JoWe-weight-measurements-delete-user-data-dev]
module.auth.aws_cognito_user_pool_client.client: Refreshing state... [id=73789kqs6iec23pqcqjsq0ted8]
module.db.data.aws_iam_policy_document.dynamodb_read_only_policy_doc: Refreshing...
module.db.data.aws_iam_policy_document.dynamodb_read_only_policy_doc: Refresh complete after 0s [id=3300638104]
module.db.data.aws_iam_policy_document.dynamodb_jowe_measurements_crud_policy: Refreshing...
module.db.data.aws_iam_policy_document.dynamodb_jowe_measurements_crud_policy: Refresh complete after 0s [id=2947198833]
module.sns_and_sqs.aws_iam_policy.sns_delete_user_data_topic_publish_policy: Refreshing state... [id=arn:aws:iam::834514932971:policy/JoWe-sns-delete-user-data-topic-publish-policy-dev]
module.api.aws_api_gateway_request_validator.jowe_api_request_validator: Refreshing state... [id=s8r6jk]
module.api.aws_api_gateway_model.weight_target_response: Refreshing state... [id=o240xi]
module.api.aws_api_gateway_resource.weight_resource: Refreshing state... [id=9d506r]
module.api.aws_api_gateway_gateway_response.jowe_api_gateway_response_default_5XX: Refreshing state... [id=aggr-gaj1kflz21-DEFAULT_5XX]
module.api.aws_api_gateway_model.weight_targets_insert_request: Refreshing state... [id=3z47ce]
module.api.aws_api_gateway_model.weight_targets_response: Refreshing state... [id=7rivhe]
module.api.aws_api_gateway_model.weight_measurments_insert_request: Refreshing state... [id=be8t2d]
module.api.aws_api_gateway_gateway_response.jowe_api_gateway_response_default_4XX: Refreshing state... [id=aggr-gaj1kflz21-DEFAULT_4XX]
module.api.aws_api_gateway_resource.admin_resource: Refreshing state... [id=ma74g7]
module.api.aws_api_gateway_model.common_error_response: Refreshing state... [id=oybbak]
module.api.aws_api_gateway_model.weight_measurment_response: Refreshing state... [id=p46fxr]
module.api.aws_api_gateway_model.weight_measurments_response: Refreshing state... [id=ylrkio]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_crud_AWSLambdaBasicExecutionRole_attachment: Refreshing state... [id=JoWe-api-lambda-crud-dev-20230725192625378200000002]
module.db.aws_iam_policy.dynamodb_measurements_read_only_policy: Refreshing state... [id=arn:aws:iam::834514932971:policy/JoWe-dynamodb-measurements-read-only-policy-dev]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_read_only_AWSLambdaBasicExecutionRole_attachment: Refreshing state... [id=JoWe-api-lambda-read-only-dev-20230725192625368600000001]
module.db.aws_iam_policy.dynamodb_measurements_crud_policy: Refreshing state... [id=arn:aws:iam::834514932971:policy/JoWe-dynamodb-measurements-crud-policy-dev]
module.api.aws_api_gateway_account.jowe_api_gateway_account: Refreshing state... [id=api-gateway-account]
module.sns_and_sqs.aws_sqs_queue_policy.delete_user_data_weight_targets_subscription: Refreshing state... [id=https://sqs.eu-south-1.amazonaws.com/834514932971/JoWe-weight-targets-delete-user-data-dev]
module.api.aws_iam_role_policy.api_gateway_cloudwatch_policy: Refreshing state... [id=JoWe-api-gateway-role-dev:JoWe-api-gateway-cloudwatch-policy-dev]
module.sns_and_sqs.aws_sns_topic_subscription.delete_user_data_weight_targets: Refreshing state... [id=arn:aws:sns:eu-south-1:834514932971:JoWe-delete-user-data-topic-dev:356c500b-0819-4a27-9b3b-c5dff079456c]
module.sns_and_sqs.data.aws_iam_policy_document.sqs_weight_targets_delete_user_data_queue_process_policy: Refreshing...
module.sns_and_sqs.data.aws_iam_policy_document.sqs_weight_targets_delete_user_data_queue_process_policy: Refresh complete after 0s [id=1171862333]
module.api.aws_api_gateway_resource.weight_targets_resource: Refreshing state... [id=l1qa8q]
module.api.aws_api_gateway_resource.weight_measurements_resource: Refreshing state... [id=5mtizn]
module.sns_and_sqs.data.aws_iam_policy_document.sqs_weight_measurements_delete_user_data_queue_process_policy: Refreshing...
module.sns_and_sqs.data.aws_iam_policy_document.sqs_weight_measurements_delete_user_data_queue_process_policy: Refresh complete after 0s [id=4141459059]
module.sns_and_sqs.aws_sqs_queue_policy.delete_user_data_weight_measurements_subscription: Refreshing state... [id=https://sqs.eu-south-1.amazonaws.com/834514932971/JoWe-weight-measurements-delete-user-data-dev]
module.sns_and_sqs.aws_sns_topic_subscription.delete_user_data_weight_measurements: Refreshing state... [id=arn:aws:sns:eu-south-1:834514932971:JoWe-delete-user-data-topic-dev:7a6375cd-e4ce-48b7-85ac-8cc58ef3f811]
module.api.aws_api_gateway_authorizer.jowe_api_authorizer: Refreshing state... [id=p6bbhi]
module.api.aws_api_gateway_resource.delete_user_data: Refreshing state... [id=j8n2v2]
module.sns_and_sqs.aws_iam_policy.sqs_weight_targets_delete_user_data_queue_process_policy: Refreshing state... [id=arn:aws:iam::834514932971:policy/JoWe-sqs-weight-targets-delete-user-data-queue-policy-dev]
module.sns_and_sqs.aws_iam_policy.sqs_weight_measurements_delete_user_data_queue_process_policy: Refreshing state... [id=arn:aws:iam::834514932971:policy/JoWe-sqs-weight-measurements-delete-user-data-queue-policy-dev]
module.db.data.aws_iam_policy_document.dynamodb_jowe_weight_target_crud_policy: Refreshing...
module.db.data.aws_iam_policy_document.dynamodb_jowe_weight_target_crud_policy: Refresh complete after 0s [id=1080394040]
module.db.data.aws_iam_policy_document.dynamodb_jowe_weight_target_read_only_policy: Refreshing...
module.db.data.aws_iam_policy_document.dynamodb_jowe_weight_target_read_only_policy: Refresh complete after 0s [id=3281627535]
module.db.aws_iam_policy.dynamodb_weight_target_crud_policy: Refreshing state... [id=arn:aws:iam::834514932971:policy/JoWe-dynamodb-weight-target-crud-policy-dev]
module.db.aws_iam_policy.dynamodb_weight_target_read_only_policy: Refreshing state... [id=arn:aws:iam::834514932971:policy/JoWe-dynamodb-weight-target-read-only-policy-dev]
module.api.aws_api_gateway_resource.weight_targets_id_resource: Refreshing state... [id=pu0tuf]
module.api.aws_api_gateway_method.weight_targets_method_options: Refreshing state... [id=agm-gaj1kflz21-l1qa8q-OPTIONS]
module.api.aws_api_gateway_method.weight_measurements_method_options: Refreshing state... [id=agm-gaj1kflz21-5mtizn-OPTIONS]
module.api.aws_api_gateway_resource.weight_measurements_id_resource: Refreshing state... [id=4p7ecj]
module.api.aws_api_gateway_method.weight_measurements_method_get: Refreshing state... [id=agm-gaj1kflz21-5mtizn-GET]
module.api.aws_api_gateway_method.weight_measurements_method_post: Refreshing state... [id=agm-gaj1kflz21-5mtizn-POST]
module.api.aws_api_gateway_method.weight_targets_method_get: Refreshing state... [id=agm-gaj1kflz21-l1qa8q-GET]
module.api.aws_api_gateway_method.weight_targets_method_post: Refreshing state... [id=agm-gaj1kflz21-l1qa8q-POST]
module.api.aws_api_gateway_method.delete_user_data_method_options: Refreshing state... [id=agm-gaj1kflz21-j8n2v2-OPTIONS]
module.api.aws_api_gateway_method.delete_user_data_method_post: Refreshing state... [id=agm-gaj1kflz21-j8n2v2-POST]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_sqs_processing_weight_targets_delete_user_data_role_attachment: Refreshing state... [id=JoWe-api-lambda-crud-dev-20230725192715349600000007]
module.api.aws_api_gateway_integration.weight_targets_integration_options: Refreshing state... [id=agi-gaj1kflz21-l1qa8q-OPTIONS]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_sqs_processing_weight_measurements_delete_user_data_role_attachment: Refreshing state... [id=JoWe-api-lambda-crud-dev-20230725192715354100000009]
module.api.aws_iam_role_policy_attachment.jowe_api_gateway_sns_delete_user_data_topic_publish_role_attachment: Refreshing state... [id=JoWe-api-gateway-role-dev-20230820173629212400000001]
module.api.aws_api_gateway_method.weight_targets_id_method_get: Refreshing state... [id=agm-gaj1kflz21-pu0tuf-GET]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_dynamodb_crud_role_attachment_weight_targets: Refreshing state... [id=JoWe-api-lambda-crud-dev-20230725192637369400000004]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_dynamodb_crud_role_attachment_weight_measurements: Refreshing state... [id=JoWe-api-lambda-crud-dev-20230725192637370000000005]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_dynamodb_read_only_role_attachment_weight_measurements: Refreshing state... [id=JoWe-api-lambda-read-only-dev-20230725192637358700000003]
module.api.aws_api_gateway_method.weight_targets_id_method_delete: Refreshing state... [id=agm-gaj1kflz21-pu0tuf-DELETE]
module.api.aws_api_gateway_method.weight_targets_id_method_options: Refreshing state... [id=agm-gaj1kflz21-pu0tuf-OPTIONS]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_dynamodb_read_only_role_attachment_weight_targets: Refreshing state... [id=JoWe-api-lambda-read-only-dev-20230725192637373300000006]
module.api.aws_api_gateway_method.weight_measurements_id_method_get: Refreshing state... [id=agm-gaj1kflz21-4p7ecj-GET]
module.api.aws_api_gateway_method.weight_measurements_id_method_options: Refreshing state... [id=agm-gaj1kflz21-4p7ecj-OPTIONS]
module.api.aws_api_gateway_method.weight_measurements_id_method_delete: Refreshing state... [id=agm-gaj1kflz21-4p7ecj-DELETE]
module.api.aws_api_gateway_method.weight_measurements_id_method_put: Refreshing state... [id=agm-gaj1kflz21-4p7ecj-PUT]
module.api.aws_api_gateway_integration.weight_measurements_integration_options: Refreshing state... [id=agi-gaj1kflz21-5mtizn-OPTIONS]
module.api.aws_api_gateway_integration.delete_user_data_integration_options: Refreshing state... [id=agi-gaj1kflz21-j8n2v2-OPTIONS]
module.lambda.aws_lambda_function.weight_targets_insert_lambda: Refreshing state... [id=JoWe-api-weight-targets-insert-dev]
module.lambda.aws_lambda_function.weight_targets_delete_user_data_lambda: Refreshing state... [id=JoWe-api-weight-targets-delete-user-data-dev]
module.lambda.aws_lambda_function.weight_targets_delete_lambda: Refreshing state... [id=JoWe-api-weight-targets-delete-dev]
module.lambda.aws_lambda_function.weight_measurements_retrieve_lambda: Refreshing state... [id=JoWe-api-weight-measurements-retrieve-dev]
module.lambda.aws_lambda_function.weight_measurements_insert_lambda: Refreshing state... [id=JoWe-api-weight-measurements-insert-dev]
module.lambda.aws_lambda_function.weight_measurements_delete_lambda: Refreshing state... [id=JoWe-api-weight-measurements-delete-dev]
module.lambda.aws_lambda_function.weight_measurements_delete_user_data_lambda: Refreshing state... [id=JoWe-api-weight-measurements-delete-user-data-dev]
module.lambda.aws_lambda_function.weight_measurements_edit_lambda: Refreshing state... [id=JoWe-api-weight-measurements-edit-dev]
module.lambda.aws_lambda_function.weight_targets_retrieve_lambda: Refreshing state... [id=JoWe-api-weight-targets-retrieve-dev]
module.api.aws_api_gateway_integration.delete_user_data_integration_post: Refreshing state... [id=agi-gaj1kflz21-j8n2v2-POST]
module.api.aws_api_gateway_method_response.weight_targets_method_options_200: Refreshing state... [id=agmr-gaj1kflz21-l1qa8q-OPTIONS-200]
module.api.aws_api_gateway_integration.weight_targets_id_integration_options: Refreshing state... [id=agi-gaj1kflz21-pu0tuf-OPTIONS]
module.api.aws_api_gateway_integration.weight_measurements_id_integration_options: Refreshing state... [id=agi-gaj1kflz21-4p7ecj-OPTIONS]
module.api.aws_api_gateway_method_response.weight_measurements_method_options_200: Refreshing state... [id=agmr-gaj1kflz21-5mtizn-OPTIONS-200]
module.api.aws_api_gateway_method_response.delete_user_data_method_options_200: Refreshing state... [id=agmr-gaj1kflz21-j8n2v2-OPTIONS-200]
module.api.aws_api_gateway_method_response.delete_user_data_method_post_500: Refreshing state... [id=agmr-gaj1kflz21-j8n2v2-POST-500]
module.api.aws_api_gateway_method_response.delete_user_data_method_post_200: Refreshing state... [id=agmr-gaj1kflz21-j8n2v2-POST-200]
module.api.aws_api_gateway_integration_response.weight_targets_integration_res_options_200: Refreshing state... [id=agir-gaj1kflz21-l1qa8q-OPTIONS-200]
module.lambda.aws_lambda_permission.weight_measurements_delete_user_data_lambda_cloudwatch_permission: Refreshing state... [id=AllowExecutionFromCloudWatch]
module.lambda.aws_lambda_permission.weight_targets_delete_user_data_lambda_cloudwatch_permission: Refreshing state... [id=AllowExecutionFromCloudWatch]
module.lambda.aws_cloudwatch_event_target.user_data_deletion_schedule_weight_measurements: Refreshing state... [id=JoWe-cloudwatch-user-data-deletion-schedule-dev-terraform-20230825205125577600000001]
module.lambda.aws_cloudwatch_event_target.user_data_deletion_schedule_weight_targets: Refreshing state... [id=JoWe-cloudwatch-user-data-deletion-schedule-dev-terraform-20230825223919251000000001]
module.api.aws_api_gateway_integration_response.delete_user_data_integration_res_post_500: Refreshing state... [id=agir-gaj1kflz21-j8n2v2-POST-500]
module.api.aws_lambda_permission.gateway_lambda_permission_retrieve_single_weight_target: Refreshing state... [id=terraform-20230725192742655400000011]
module.api.aws_lambda_permission.gateway_lambda_permission_get_id_weight_target: Refreshing state... [id=terraform-2023072519274240960000000a]
module.api.aws_lambda_permission.gateway_lambda_permission_retrieve_single_weight_measurements: Refreshing state... [id=terraform-2023072519274241200000000d]
module.api.aws_lambda_permission.gateway_lambda_permission_get_id_weight_measurement: Refreshing state... [id=terraform-20230725192742658500000012]
module.api.aws_lambda_permission.gateway_lambda_permission_post_weight_targets: Refreshing state... [id=terraform-20230725192742660500000013]
module.api.aws_lambda_permission.gateway_lambda_permission_delete_weight_measurement: Refreshing state... [id=terraform-2023072519274241150000000b]
module.api.aws_lambda_permission.gateway_lambda_permission_put_weight_measurement: Refreshing state... [id=terraform-20230809191851589900000001]
module.api.aws_lambda_permission.gateway_lambda_permission_delete_weight_target: Refreshing state... [id=terraform-20230725192742652900000010]
module.api.aws_lambda_permission.gateway_lambda_permission_retrieve_all_weight_targets: Refreshing state... [id=terraform-2023072519274241160000000c]
module.api.aws_lambda_permission.gateway_lambda_permission_retrieve_all_weight_measurements: Refreshing state... [id=terraform-2023072519274241260000000f]
module.api.aws_lambda_permission.gateway_lambda_permission_post_weight_measurements: Refreshing state... [id=terraform-2023072519274241240000000e]
module.api.aws_api_gateway_integration.weight_targets_id_integration_get: Refreshing state... [id=agi-gaj1kflz21-pu0tuf-GET]
module.api.aws_api_gateway_integration.weight_targets_integration_post: Refreshing state... [id=agi-gaj1kflz21-l1qa8q-POST]
module.api.aws_api_gateway_integration.weight_measurements_id_integration_get: Refreshing state... [id=agi-gaj1kflz21-4p7ecj-GET]
module.api.aws_api_gateway_integration.weight_measurements_id_integration_delete: Refreshing state... [id=agi-gaj1kflz21-4p7ecj-DELETE]
module.api.aws_api_gateway_integration.weight_measurements_id_integration_put: Refreshing state... [id=agi-gaj1kflz21-4p7ecj-PUT]
module.api.aws_api_gateway_integration.weight_targets_id_integration_delete: Refreshing state... [id=agi-gaj1kflz21-pu0tuf-DELETE]
module.api.aws_api_gateway_integration.weight_targets_integration_get: Refreshing state... [id=agi-gaj1kflz21-l1qa8q-GET]
module.api.aws_api_gateway_integration.weight_measurements_integration_get: Refreshing state... [id=agi-gaj1kflz21-5mtizn-GET]
module.api.aws_api_gateway_integration.weight_measurements_integration_post: Refreshing state... [id=agi-gaj1kflz21-5mtizn-POST]
module.api.aws_api_gateway_method_response.weight_targets_method_post_400: Refreshing state... [id=agmr-gaj1kflz21-l1qa8q-POST-400]
module.api.aws_api_gateway_method_response.weight_targets_method_post_200: Refreshing state... [id=agmr-gaj1kflz21-l1qa8q-POST-200]
module.api.aws_api_gateway_method_response.weight_targets_method_post_500: Refreshing state... [id=agmr-gaj1kflz21-l1qa8q-POST-500]
module.api.aws_api_gateway_method_response.weight_measurements_id_method_delete_500: Refreshing state... [id=agmr-gaj1kflz21-4p7ecj-DELETE-500]
module.api.aws_api_gateway_method_response.weight_measurements_id_method_delete_200: Refreshing state... [id=agmr-gaj1kflz21-4p7ecj-DELETE-200]
module.api.aws_api_gateway_method_response.weight_measurements_id_method_put_500: Refreshing state... [id=agmr-gaj1kflz21-4p7ecj-PUT-500]
module.api.aws_api_gateway_method_response.weight_measurements_id_method_put_200: Refreshing state... [id=agmr-gaj1kflz21-4p7ecj-PUT-200]
module.api.aws_api_gateway_method_response.weight_targets_id_method_delete_200: Refreshing state... [id=agmr-gaj1kflz21-pu0tuf-DELETE-200]
module.api.aws_api_gateway_method_response.weight_targets_id_method_delete_500: Refreshing state... [id=agmr-gaj1kflz21-pu0tuf-DELETE-500]
module.api.aws_api_gateway_method_response.weight_measurements_method_get_500: Refreshing state... [id=agmr-gaj1kflz21-5mtizn-GET-500]
module.api.aws_api_gateway_method_response.weight_measurements_method_get_400: Refreshing state... [id=agmr-gaj1kflz21-5mtizn-GET-400]
module.api.aws_api_gateway_method_response.weight_measurements_method_get_200: Refreshing state... [id=agmr-gaj1kflz21-5mtizn-GET-200]
module.api.aws_api_gateway_method_response.weight_targets_id_method_res_options_200: Refreshing state... [id=agmr-gaj1kflz21-pu0tuf-OPTIONS-200]
module.api.aws_api_gateway_integration_response.weight_targets_integration_res_post_400: Refreshing state... [id=agir-gaj1kflz21-l1qa8q-POST-400]
module.api.aws_api_gateway_integration_response.weight_targets_integration_res_post_200: Refreshing state... [id=agir-gaj1kflz21-l1qa8q-POST-200]
module.api.aws_api_gateway_integration_response.weight_targets_integration_res_post_500: Refreshing state... [id=agir-gaj1kflz21-l1qa8q-POST-500]
module.api.aws_api_gateway_method_response.weight_measurements_id_method_res_options_200: Refreshing state... [id=agmr-gaj1kflz21-4p7ecj-OPTIONS-200]
module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_delete_500: Refreshing state... [id=agir-gaj1kflz21-4p7ecj-DELETE-500]
module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_put_500: Refreshing state... [id=agir-gaj1kflz21-4p7ecj-PUT-500]
module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_put_200: Refreshing state... [id=agir-gaj1kflz21-4p7ecj-PUT-200]
module.api.aws_api_gateway_integration_response.delete_user_data_integration_res_post_200: Refreshing state... [id=agir-gaj1kflz21-j8n2v2-POST-200]
module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_delete_200: Refreshing state... [id=agir-gaj1kflz21-pu0tuf-DELETE-200]
module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_delete_500: Refreshing state... [id=agir-gaj1kflz21-pu0tuf-DELETE-500]
module.api.aws_api_gateway_integration_response.weight_measurements_integration_get_res_400: Refreshing state... [id=agir-gaj1kflz21-5mtizn-GET-400]
module.api.aws_api_gateway_integration_response.weight_measurements_integration_get_res_200: Refreshing state... [id=agir-gaj1kflz21-5mtizn-GET-200]
module.api.aws_api_gateway_method_response.weight_measurements_method_post_500: Refreshing state... [id=agmr-gaj1kflz21-5mtizn-POST-500]
module.api.aws_api_gateway_method_response.weight_measurements_method_post_400: Refreshing state... [id=agmr-gaj1kflz21-5mtizn-POST-400]
module.api.aws_api_gateway_method_response.weight_measurements_method_post_200: Refreshing state... [id=agmr-gaj1kflz21-5mtizn-POST-200]
module.api.aws_api_gateway_integration_response.weight_measurements_integration_res_get_500: Refreshing state... [id=agir-gaj1kflz21-5mtizn-GET-500]
module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_options_200: Refreshing state... [id=agir-gaj1kflz21-pu0tuf-OPTIONS-200]
module.api.aws_api_gateway_method_response.weight_targets_id_method_res_get_400: Refreshing state... [id=agmr-gaj1kflz21-pu0tuf-GET-400]
module.api.aws_api_gateway_method_response.weight_targets_id_method_res_get_200: Refreshing state... [id=agmr-gaj1kflz21-pu0tuf-GET-200]
module.api.aws_api_gateway_method_response.weight_targets_id_method_res_get_500: Refreshing state... [id=agmr-gaj1kflz21-pu0tuf-GET-500]
module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_delete_200: Refreshing state... [id=agir-gaj1kflz21-4p7ecj-DELETE-200]
module.api.aws_api_gateway_method_response.weight_targets_method_get_200: Refreshing state... [id=agmr-gaj1kflz21-l1qa8q-GET-200]
module.api.aws_api_gateway_method_response.weight_targets_method_get_500: Refreshing state... [id=agmr-gaj1kflz21-l1qa8q-GET-500]
module.api.aws_api_gateway_method_response.weight_targets_method_get_400: Refreshing state... [id=agmr-gaj1kflz21-l1qa8q-GET-400]
module.api.aws_api_gateway_integration_response.weight_measurements_integration_res_post_500: Refreshing state... [id=agir-gaj1kflz21-5mtizn-POST-500]
module.api.aws_api_gateway_integration_response.weight_measurements_integration_res_post_400: Refreshing state... [id=agir-gaj1kflz21-5mtizn-POST-400]
module.api.aws_api_gateway_integration_response.weight_measurements_integration_res_post_200: Refreshing state... [id=agir-gaj1kflz21-5mtizn-POST-200]
module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_get_200: Refreshing state... [id=agir-gaj1kflz21-pu0tuf-GET-200]
module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_get_500: Refreshing state... [id=agir-gaj1kflz21-pu0tuf-GET-500]
module.api.aws_api_gateway_integration_response.weight_targets_integration_get_res_200: Refreshing state... [id=agir-gaj1kflz21-l1qa8q-GET-200]
module.api.aws_api_gateway_integration_response.weight_measurements_integration_res_options_200: Refreshing state... [id=agir-gaj1kflz21-5mtizn-OPTIONS-200]
module.api.aws_api_gateway_integration_response.weight_targets_integration_res_get_500: Refreshing state... [id=agir-gaj1kflz21-l1qa8q-GET-500]
module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_get_400: Refreshing state... [id=agir-gaj1kflz21-pu0tuf-GET-400]
module.api.aws_api_gateway_method_response.weight_measurements_id_method_res_get_400: Refreshing state... [id=agmr-gaj1kflz21-4p7ecj-GET-400]
module.api.aws_api_gateway_method_response.weight_measurements_id_method_res_get_200: Refreshing state... [id=agmr-gaj1kflz21-4p7ecj-GET-200]
module.api.aws_api_gateway_deployment.jowe_api_deployment: Refreshing state... [id=hq9s7j]
module.api.aws_api_gateway_method_response.weight_measurements_id_method_res_get_500: Refreshing state... [id=agmr-gaj1kflz21-4p7ecj-GET-500]
module.api.aws_api_gateway_integration_response.weight_targets_integration_get_res_400: Refreshing state... [id=agir-gaj1kflz21-l1qa8q-GET-400]
module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_get_400: Refreshing state... [id=agir-gaj1kflz21-4p7ecj-GET-400]
module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_get_500: Refreshing state... [id=agir-gaj1kflz21-4p7ecj-GET-500]
module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_get_200: Refreshing state... [id=agir-gaj1kflz21-4p7ecj-GET-200]
module.api.aws_api_gateway_stage.jowe_stage: Refreshing state... [id=ags-gaj1kflz21-dev]
module.api.aws_api_gateway_base_path_mapping.custom_domain_name_stage_mapping: Refreshing state... [id=jowe-api-dev.initialised.si/]
module.api.aws_api_gateway_method_settings.jowe_stage_settings: Refreshing state... [id=gaj1kflz21-dev-*/*]
module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_options_200: Refreshing state... [id=agir-gaj1kflz21-4p7ecj-OPTIONS-200]
module.api.aws_api_gateway_integration_response.delete_user_data_integration_res_options_200: Refreshing state... [id=agir-gaj1kflz21-j8n2v2-OPTIONS-200]
module.auth.aws_cognito_user_pool.user_pool: Drift detected (update)
module.lambda.aws_lambda_function.weight_targets_delete_user_data_lambda: Drift detected (update)
module.lambda.aws_lambda_layer_version.common_layer: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.api.aws_api_gateway_deployment.jowe_api_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "jowe_api_deployment" {
      ~ created_date  = "2023-08-25T22:38:35Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:eu-south-1:834514932971:gaj1kflz21/" -> (known after apply)
      ~ id            = "hq9s7j" -> (known after apply)
      ~ invoke_url    = "https://gaj1kflz21.execute-api.eu-south-1.amazonaws.com/" -> (known after apply)
      ~ variables     = { # forces replacement
          - "deployed_at" = "2023-08-25T22:38:34Z"
        } -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.delete_user_data_integration_options will be updated in-place
  ~ resource "aws_api_gateway_integration" "delete_user_data_integration_options" {
        id                   = "agi-gaj1kflz21-j8n2v2-OPTIONS"
      ~ request_templates    = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    statusCode = 200
                }
            )
        }
        # (10 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_measurements_id_integration_delete will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_measurements_id_integration_delete" {
        id                      = "agi-gaj1kflz21-4p7ecj-DELETE"
      ~ request_templates       = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    measurementId = "$input.params('measurementId')"
                    userId        = "$context.authorizer.claims.sub"
                }
            )
        }
        # (12 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_measurements_id_integration_get will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_measurements_id_integration_get" {
        id                      = "agi-gaj1kflz21-4p7ecj-GET"
      ~ request_templates       = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    measurementId = "$input.params('measurementId')"
                    type          = "single"
                    userId        = "$context.authorizer.claims.sub"
                }
            )
        }
        # (12 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_measurements_id_integration_options will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_measurements_id_integration_options" {
        id                   = "agi-gaj1kflz21-4p7ecj-OPTIONS"
      ~ request_templates    = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    statusCode = 200
                }
            )
        }
        # (10 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_measurements_id_integration_put will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_measurements_id_integration_put" {
        id                      = "agi-gaj1kflz21-4p7ecj-PUT"
      ~ request_templates       = {
          ~ "application/json" = <<-EOT
              - #set($inputRoot = $input.path('$'))
              - #set($hasNote =  $input.path('$.measurement.note') != "")
              - #set($hasBodyFatPercentage =  $input.path('$.measurement.measurements.bodyFatPercentage') != "")
              - #set($hasWaterPercentage = $input.path('$.measurement.measurements.waterPercentage') != "")
              - #set($hasMuscleMassPercentage = $input.path('$.measurement.measurements.muscleMassPercentage') != "")
              - #set($hasBonePercentage = $input.path('$.measurement.measurements.bonePercentage') != "")
              - #set($hasEnergyExpenditure = $input.path('$.measurement.measurements.energyExpenditure') != "")
              - {
              -   "measurement" : {
              -     "measurementId": "$input.params('measurementId')",
              -     "userId": "$context.authorizer.claims.sub",
              -     "date": $inputRoot.measurement.date,
              -     #if($hasNote) "note": "$inputRoot.measurement.note", #end
              -     "measurements": {
              -       "weight" : $inputRoot.measurement.measurements.weight
              -       #if($hasBodyFatPercentage), "bodyFatPercentage": $inputRoot.measurement.measurements.bodyFatPercentage #end
              -       #if($hasWaterPercentage), "waterPercentage": $inputRoot.measurement.measurements.waterPercentage #end
              -       #if($hasMuscleMassPercentage), "muscleMassPercentage": $inputRoot.measurement.measurements.muscleMassPercentage #end
              -       #if($hasBonePercentage), "bonePercentage": $inputRoot.measurement.measurements.bonePercentage #end
              -       #if($hasEnergyExpenditure), "energyExpenditure": $inputRoot.measurement.measurements.energyExpenditure #end
              -     }
              -   }
              + #set($inputRoot = $input.path('$'))
              + #set($hasNote =  $input.path('$.measurement.note') != "")
              + #set($hasBodyFatPercentage =  $input.path('$.measurement.measurements.bodyFatPercentage') != "")
              + #set($hasWaterPercentage = $input.path('$.measurement.measurements.waterPercentage') != "")
              + #set($hasMuscleMassPercentage = $input.path('$.measurement.measurements.muscleMassPercentage') != "")
              + #set($hasBonePercentage = $input.path('$.measurement.measurements.bonePercentage') != "")
              + #set($hasEnergyExpenditure = $input.path('$.measurement.measurements.energyExpenditure') != "")
              + {
              +   "measurement" : {
              +     "measurementId": "$input.params('measurementId')",
              +     "userId": "$context.authorizer.claims.sub",
              +     "date": $inputRoot.measurement.date,
              +     #if($hasNote) "note": "$inputRoot.measurement.note", #end
              +     "measurements": {
              +       "weight" : $inputRoot.measurement.measurements.weight
              +       #if($hasBodyFatPercentage), "bodyFatPercentage": $inputRoot.measurement.measurements.bodyFatPercentage #end
              +       #if($hasWaterPercentage), "waterPercentage": $inputRoot.measurement.measurements.waterPercentage #end
              +       #if($hasMuscleMassPercentage), "muscleMassPercentage": $inputRoot.measurement.measurements.muscleMassPercentage #end
              +       #if($hasBonePercentage), "bonePercentage": $inputRoot.measurement.measurements.bonePercentage #end
              +       #if($hasEnergyExpenditure), "energyExpenditure": $inputRoot.measurement.measurements.energyExpenditure #end
              +     }
              +   }
                }
            EOT
        }
        # (12 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_measurements_integration_get will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_measurements_integration_get" {
        id                      = "agi-gaj1kflz21-5mtizn-GET"
      ~ request_templates       = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    type   = "all"
                    userId = "$context.authorizer.claims.sub"
                }
            )
        }
        # (12 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_measurements_integration_options will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_measurements_integration_options" {
        id                   = "agi-gaj1kflz21-5mtizn-OPTIONS"
      ~ request_templates    = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    statusCode = 200
                }
            )
        }
        # (10 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_measurements_integration_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_measurements_integration_post" {
        id                      = "agi-gaj1kflz21-5mtizn-POST"
      ~ request_templates       = {
          ~ "application/json" = <<-EOT
              - #set($inputRoot = $input.path('$'))
              - #set($hasNote =  $input.path('$.measurement.note') != "")
              - #set($hasBodyFatPercentage =  $input.path('$.measurement.measurements.bodyFatPercentage') != "")
              - #set($hasWaterPercentage = $input.path('$.measurement.measurements.waterPercentage') != "")
              - #set($hasMuscleMassPercentage = $input.path('$.measurement.measurements.muscleMassPercentage') != "")
              - #set($hasBonePercentage = $input.path('$.measurement.measurements.bonePercentage') != "")
              - #set($hasEnergyExpenditure = $input.path('$.measurement.measurements.energyExpenditure') != "")
              - {
              -   "measurement" : {
              -     "userId": "$context.authorizer.claims.sub",
              -     "date": $inputRoot.measurement.date,
              -     #if($hasNote) "note": "$inputRoot.measurement.note", #end
              -     "measurements": {
              -       "weight" : $inputRoot.measurement.measurements.weight
              -       #if($hasBodyFatPercentage), "bodyFatPercentage": $inputRoot.measurement.measurements.bodyFatPercentage #end
              -       #if($hasWaterPercentage), "waterPercentage": $inputRoot.measurement.measurements.waterPercentage #end
              -       #if($hasMuscleMassPercentage), "muscleMassPercentage": $inputRoot.measurement.measurements.muscleMassPercentage #end
              -       #if($hasBonePercentage), "bonePercentage": $inputRoot.measurement.measurements.bonePercentage #end
              -       #if($hasEnergyExpenditure), "energyExpenditure": $inputRoot.measurement.measurements.energyExpenditure #end
              -     }
              -   }
              + #set($inputRoot = $input.path('$'))
              + #set($hasNote =  $input.path('$.measurement.note') != "")
              + #set($hasBodyFatPercentage =  $input.path('$.measurement.measurements.bodyFatPercentage') != "")
              + #set($hasWaterPercentage = $input.path('$.measurement.measurements.waterPercentage') != "")
              + #set($hasMuscleMassPercentage = $input.path('$.measurement.measurements.muscleMassPercentage') != "")
              + #set($hasBonePercentage = $input.path('$.measurement.measurements.bonePercentage') != "")
              + #set($hasEnergyExpenditure = $input.path('$.measurement.measurements.energyExpenditure') != "")
              + {
              +   "measurement" : {
              +     "userId": "$context.authorizer.claims.sub",
              +     "date": $inputRoot.measurement.date,
              +     #if($hasNote) "note": "$inputRoot.measurement.note", #end
              +     "measurements": {
              +       "weight" : $inputRoot.measurement.measurements.weight
              +       #if($hasBodyFatPercentage), "bodyFatPercentage": $inputRoot.measurement.measurements.bodyFatPercentage #end
              +       #if($hasWaterPercentage), "waterPercentage": $inputRoot.measurement.measurements.waterPercentage #end
              +       #if($hasMuscleMassPercentage), "muscleMassPercentage": $inputRoot.measurement.measurements.muscleMassPercentage #end
              +       #if($hasBonePercentage), "bonePercentage": $inputRoot.measurement.measurements.bonePercentage #end
              +       #if($hasEnergyExpenditure), "energyExpenditure": $inputRoot.measurement.measurements.energyExpenditure #end
              +     }
              +   }
                }
            EOT
        }
        # (12 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_targets_id_integration_delete will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_targets_id_integration_delete" {
        id                      = "agi-gaj1kflz21-pu0tuf-DELETE"
      ~ request_templates       = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    recordId = "$input.params('recordId')"
                    userId   = "$context.authorizer.claims.sub"
                }
            )
        }
        # (12 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_targets_id_integration_get will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_targets_id_integration_get" {
        id                      = "agi-gaj1kflz21-pu0tuf-GET"
      ~ request_templates       = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    recordId = "$input.params('recordId')"
                    type     = "single"
                    userId   = "$context.authorizer.claims.sub"
                }
            )
        }
        # (12 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_targets_id_integration_options will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_targets_id_integration_options" {
        id                   = "agi-gaj1kflz21-pu0tuf-OPTIONS"
      ~ request_templates    = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    statusCode = 200
                }
            )
        }
        # (10 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_targets_integration_get will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_targets_integration_get" {
        id                      = "agi-gaj1kflz21-l1qa8q-GET"
      ~ request_templates       = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    type   = "all"
                    userId = "$context.authorizer.claims.sub"
                }
            )
        }
        # (12 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_targets_integration_options will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_targets_integration_options" {
        id                   = "agi-gaj1kflz21-l1qa8q-OPTIONS"
      ~ request_templates    = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    statusCode = 200
                }
            )
        }
        # (10 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_targets_integration_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_targets_integration_post" {
        id                      = "agi-gaj1kflz21-l1qa8q-POST"
      ~ request_templates       = {
          ~ "application/json" = <<-EOT
              - #set($inputRoot = $input.path('$'))
              - {
              -   "userId": "$context.authorizer.claims.sub",
              -   "targetWeight": $inputRoot.targetWeight
              + #set($inputRoot = $input.path('$'))
              + {
              +   "userId": "$context.authorizer.claims.sub",
              +   "targetWeight": $inputRoot.targetWeight
                }
            EOT
        }
        # (12 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.delete_user_data_integration_res_post_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "delete_user_data_integration_res_post_500" {
        id                  = "agir-gaj1kflz21-j8n2v2-POST-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_delete_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_measurements_id_integration_res_delete_500" {
        id                  = "agir-gaj1kflz21-4p7ecj-DELETE-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_get_200 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_measurements_id_integration_res_get_200" {
        id                  = "agir-gaj1kflz21-4p7ecj-GET-200"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - {
              -   "measurement": $input.json('$.body.measurement')
              + {
              +   "measurement": $input.json('$.body.measurement')
                }
            EOT
        }
        # (5 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_get_400 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_measurements_id_integration_res_get_400" {
        id                  = "agir-gaj1kflz21-4p7ecj-GET-400"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_get_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_measurements_id_integration_res_get_500" {
        id                  = "agir-gaj1kflz21-4p7ecj-GET-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_put_200 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_measurements_id_integration_res_put_200" {
        id                  = "agir-gaj1kflz21-4p7ecj-PUT-200"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($hasMeasurement =  $input.json('$.body.measurements')  != "")
              - {
              -   "measurement": #if($hasMeasurement) $input.json('$.body.measurement') #else {} #end
              + #set($hasMeasurement =  $input.json('$.body.measurements')  != "")
              + {
              +   "measurement": #if($hasMeasurement) $input.json('$.body.measurement') #else {} #end
                }
            EOT
        }
        # (5 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_put_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_measurements_id_integration_res_put_500" {
        id                  = "agir-gaj1kflz21-4p7ecj-PUT-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_measurements_integration_get_res_200 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_measurements_integration_get_res_200" {
        id                  = "agir-gaj1kflz21-5mtizn-GET-200"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($hasNoMeasurements =  $input.json('$.body.measurements').isEmpty())
              - {
              -   "measurements": #if($hasNoMeasurements) [] #else $input.json('$.body.measurements') #end
              + #set($hasNoMeasurements =  $input.json('$.body.measurements').isEmpty())
              + {
              +   "measurements": #if($hasNoMeasurements) [] #else $input.json('$.body.measurements') #end
                }
            EOT
        }
        # (5 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_measurements_integration_get_res_400 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_measurements_integration_get_res_400" {
        id                  = "agir-gaj1kflz21-5mtizn-GET-400"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_measurements_integration_res_get_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_measurements_integration_res_get_500" {
        id                  = "agir-gaj1kflz21-5mtizn-GET-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_measurements_integration_res_post_200 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_measurements_integration_res_post_200" {
        id                  = "agir-gaj1kflz21-5mtizn-POST-200"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($hasMeasurement =  $input.json('$.body.measurements')  != "")
              - {
              -   "measurement": #if($hasMeasurement) $input.json('$.body.measurement') #else {} #end
              + #set($hasMeasurement =  $input.json('$.body.measurements')  != "")
              + {
              +   "measurement": #if($hasMeasurement) $input.json('$.body.measurement') #else {} #end
                }
            EOT
        }
        # (5 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_measurements_integration_res_post_400 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_measurements_integration_res_post_400" {
        id                  = "agir-gaj1kflz21-5mtizn-POST-400"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_measurements_integration_res_post_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_measurements_integration_res_post_500" {
        id                  = "agir-gaj1kflz21-5mtizn-POST-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_delete_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_targets_id_integration_res_delete_500" {
        id                  = "agir-gaj1kflz21-pu0tuf-DELETE-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_get_200 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_targets_id_integration_res_get_200" {
        id                  = "agir-gaj1kflz21-pu0tuf-GET-200"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - {
              -   "target": $input.json('$.body.target')
              + {
              +   "target": $input.json('$.body.target')
                }
            EOT
        }
        # (5 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_get_400 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_targets_id_integration_res_get_400" {
        id                  = "agir-gaj1kflz21-pu0tuf-GET-400"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_get_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_targets_id_integration_res_get_500" {
        id                  = "agir-gaj1kflz21-pu0tuf-GET-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_targets_integration_get_res_200 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_targets_integration_get_res_200" {
        id                  = "agir-gaj1kflz21-l1qa8q-GET-200"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($hasNoTargets =  $input.json('$.body.targetWeights').isEmpty())
              - {
              -   "targetWeights": #if($hasNoTargets) [] #else $input.json('$.body.targetWeights') #end
              + #set($hasNoTargets =  $input.json('$.body.targetWeights').isEmpty())
              + {
              +   "targetWeights": #if($hasNoTargets) [] #else $input.json('$.body.targetWeights') #end
                }
            EOT
        }
        # (5 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_targets_integration_get_res_400 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_targets_integration_get_res_400" {
        id                  = "agir-gaj1kflz21-l1qa8q-GET-400"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_targets_integration_res_get_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_targets_integration_res_get_500" {
        id                  = "agir-gaj1kflz21-l1qa8q-GET-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_targets_integration_res_post_200 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_targets_integration_res_post_200" {
        id                  = "agir-gaj1kflz21-l1qa8q-POST-200"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($hasTarget =  $input.json('$.body.targetWeight')  != "")
              - {
              -   "target": #if($hasTarget) $input.json('$.body.targetWeight') #else {} #end
              + #set($hasTarget =  $input.json('$.body.targetWeight')  != "")
              + {
              +   "target": #if($hasTarget) $input.json('$.body.targetWeight') #else {} #end
                }
            EOT
        }
        # (5 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_targets_integration_res_post_400 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_targets_integration_res_post_400" {
        id                  = "agir-gaj1kflz21-l1qa8q-POST-400"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_targets_integration_res_post_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_targets_integration_res_post_500" {
        id                  = "agir-gaj1kflz21-l1qa8q-POST-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_stage.jowe_stage will be updated in-place
  ~ resource "aws_api_gateway_stage" "jowe_stage" {
      ~ deployment_id         = "hq9s7j" -> (known after apply)
        id                    = "ags-gaj1kflz21-dev"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # module.lambda.aws_cloudwatch_event_rule.user_data_deletion_schedule will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "user_data_deletion_schedule" {
        id                  = "JoWe-cloudwatch-user-data-deletion-schedule-dev"
        name                = "JoWe-cloudwatch-user-data-deletion-schedule-dev"
      ~ schedule_expression = "cron(0/5 * * * ? *)" -> "cron(0/30 * * * ? *)"
        tags                = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-cloudwatch-user-data-deletion-schedule"
        }
        # (5 unchanged attributes hidden)
    }

  # module.lambda.aws_lambda_function.weight_measurements_delete_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_measurements_delete_lambda" {
        id                             = "JoWe-api-weight-measurements-delete-dev"
      ~ last_modified                  = "2023-08-25T22:39:05.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:27",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:17",
        ] -> (known after apply)
      ~ source_code_hash               = "OnIhr6NKLxs5rxToe2gxNVnAAdR4k7XuNWViWiZAeZ0=" -> "J7FADzXvuiuIxn2Ivw++SXC4nb2rQreQd2nzl+lxViQ="
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-api-weight-measurements-delete"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.weight_measurements_delete_user_data_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_measurements_delete_user_data_lambda" {
        id                             = "JoWe-api-weight-measurements-delete-user-data-dev"
      ~ last_modified                  = "2023-08-25T22:39:20.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:27",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:17",
        ] -> (known after apply)
      ~ source_code_hash               = "zEuNxBiFthHKEM0mgty1POtKVdUlUQfph7zV6cSzCws=" -> "c6IhmQJsLtLB+H0bZDDRa7LZbziZNR5yOgRm1VNgX+4="
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-api-weight-measurements-delete-user-data"
        }
      ~ timeout                        = 30 -> 45
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.weight_measurements_edit_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_measurements_edit_lambda" {
        id                             = "JoWe-api-weight-measurements-edit-dev"
      ~ last_modified                  = "2023-08-25T22:39:05.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:27",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:17",
        ] -> (known after apply)
      ~ source_code_hash               = "lU3faxrTrh7WdytPdCnIbZJGdyV+UdfiMbyDB+pBxqo=" -> "VaRpNhU7kTjqEGuMYMgis2N08rQm96Er1PWh28uSdtY="
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-api-weight-measurements-edit"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.weight_measurements_insert_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_measurements_insert_lambda" {
        id                             = "JoWe-api-weight-measurements-insert-dev"
      ~ last_modified                  = "2023-08-25T22:39:05.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:27",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:17",
        ] -> (known after apply)
      ~ source_code_hash               = "v+2cleHjj6j07Py5SH5eORRwN36lbKQSGxyuKyjtXXI=" -> "5BdE77fPpsKJ751QaWyl6f/pKRJvwAB1d8sUnup3Vwk="
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-api-weight-measurements-insert"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.weight_measurements_retrieve_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_measurements_retrieve_lambda" {
        id                             = "JoWe-api-weight-measurements-retrieve-dev"
      ~ last_modified                  = "2023-08-25T22:39:05.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:27",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:17",
        ] -> (known after apply)
      ~ source_code_hash               = "GM/l1XFrRE6M8tthhWifP4ynDKPnazVOt9U69j8oNx8=" -> "5JwXeSldZN4PQp/+5g9Xe8MxrvMyLdFsWUveNNjVRTI="
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-api-weight-measurements-retrieve"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.weight_targets_delete_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_targets_delete_lambda" {
        id                             = "JoWe-api-weight-targets-delete-dev"
      ~ last_modified                  = "2023-08-25T22:39:05.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:27",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:17",
        ] -> (known after apply)
      ~ source_code_hash               = "v3dwhNBpLlvPHEtFqQ9ys9mb+tXCED2J9SuLKSMzaJE=" -> "lSvSpFwNsBD3PkYFRBUz2WcPS3MUjZ6ZGhrmh+5TCfA="
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-api-weight-targets-delete"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.weight_targets_delete_user_data_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_targets_delete_user_data_lambda" {
        id                             = "JoWe-api-weight-targets-delete-user-data-dev"
      ~ last_modified                  = "2023-08-25T22:39:19.310+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:27",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:17",
        ] -> (known after apply)
      ~ source_code_hash               = "5Sa/2SUVzdXq4BCVC47I04ImVxOM/DkaDtyQZUSuUxs=" -> "ZxahMimLpZ9Lr5TfLTWLN4ocbCQ/xoo+MIP47UDs6Qw="
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-api-weight-targets-delete"
        }
      ~ timeout                        = 30 -> 45
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.weight_targets_insert_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_targets_insert_lambda" {
        id                             = "JoWe-api-weight-targets-insert-dev"
      ~ last_modified                  = "2023-08-25T22:39:05.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:27",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:17",
        ] -> (known after apply)
      ~ source_code_hash               = "Zgg5NkoK4OAcmnCA8mC0nVaXvzAz6+xqmVTA0Z0Xhcw=" -> "vlRv9/F0sGslbtogwdQDUPKsH7VihQYPlE1agns9xOI="
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-api-weight-targets-insert"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.weight_targets_retrieve_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_targets_retrieve_lambda" {
        id                             = "JoWe-api-weight-targets-retrieve-dev"
      ~ last_modified                  = "2023-08-25T22:39:05.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:27",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:17",
        ] -> (known after apply)
      ~ source_code_hash               = "eSeVKSYSxgO53UmvLVo1rVFz72xTJp+OgglvsW7XLck=" -> "FM7WX4TIxPxWqHwj3r1h/tMF+6NHZBslrGkE8VaoSHI="
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-api-weight-targets-retrieve"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_layer_version.common_layer must be replaced
+/- resource "aws_lambda_layer_version" "common_layer" {
      ~ arn                         = "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:27" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2023-08-25T22:39:04.373+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:27" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "Wywdu3uu/AHSJXpC9ByUruXgChTH12kI+hwaHBYCoA8=" -> "GCa57fOrtrvWyJKoFdbWJjDd8vqCGYOiRtPz64FnteU=" # forces replacement
      ~ source_code_size            = 2406 -> (known after apply)
      ~ version                     = "27" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda.aws_lambda_layer_version.weight_shared_layer must be replaced
+/- resource "aws_lambda_layer_version" "weight_shared_layer" {
      ~ arn                         = "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:17" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2023-08-25T20:38:03.979+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:17" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "SXqAODkQUn4qO9uuRC/qSePAyvm8Bpj8oV92bmkMltY=" -> "Hg+HiFigTb90shYM0MSKMKIbxbyGBufKzhqqu31VU7g=" # forces replacement
      ~ source_code_size            = 2082 -> (known after apply)
      ~ version                     = "17" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 3 to add, 48 to change, 3 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 19 estimated
           $0.0/mo +$0.0

```

</details>

*Pushed by: @Andrej988, Action: `pull_request`*